EDT/УТ/src/Documents/ГрупповаяУстановкаСтатусовЗаказов/ГрупповаяУстановкаСтатусовЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГрупповаяУстановкаСтатусовЗаказов</name>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтатусыЗаказов</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.СтатусыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>DocumentRef.Рейс</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СтатусыЗаказов/СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаказов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>СтатусAxiomus</name>
    <type>
      <types>CatalogRef.СтатусыAxiomus</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредварительноеЗакрытие</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инициатор</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/ГрупповаяУстановкаСтатусовЗаказов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Подкл = Евген.СоздатьПодключениеКИнтернетМагазину();
	ТекД = ТекущаяДата();
	
	МассивСтатусов = Неопределено;// Задача № 2813

	// РС СтатусыЗаказов		
	Для Каждого ТекЗаказ Из СтатусыЗаказов Цикл
	   	    
		Набор = РегистрыСведений.СтатусыЗаказов.СоздатьНаборЗаписей();
		Набор.Отбор.Заказ.Установить(ТекЗаказ.Заказ);
		Набор.Отбор.Период.Установить(ТекД);
		Набор.Прочитать();
		
		НЗапись = Набор.Добавить();
		НЗапись.Период = ТекД;
		НЗапись.Заказ = ТекЗаказ.Заказ;
		НЗапись.Статус = ТекЗаказ.Статус.Код;
		НЗапись.ДокументРегистратор = Ссылка;		
		//НЗапись.Терминал = ТекЗаказ.Заказ.ТерминалДоставки;
		НЗапись.Терминал = ТерминалОбработки; // Задача № 3027
		Набор.Записать();
			
	   
		//СтрЗапроса = "EXEC import_setOrderStatusIDFrom1C " + Формат(Сокрлп(ТекЗаказ.Заказ.Номер), "ЧГ=") + "," + Число(Статус.Код) + ",'Заказ на магистрали'";
		//Евген.ЗапросКИнтернетМагазину(СтрЗапроса, Подкл);
		
		// Задача № 2813
		
		ДопПараметрыСтатуса = mas.ДобавитьДополнительныйПараметрСтатуса("ProcessingTerminal", Число(ТерминалОбработки.Код));// Задача № 3027

		//Асеев 07.04.2021 (Задача № 4529)>>>
		//МассивСтатусов = mas.ДобавитьПараметрыЗаказаДляУстановкиСтатуса(ТекЗаказ.Заказ.Номер, Статус.Код, "Заказ на магистрали",,,МассивСтатусов, ДопПараметрыСтатуса);
		МассивСтатусов = mas.ДобавитьПараметрыЗаказаДляУстановкиСтатуса(ТекЗаказ.Заказ.Номер, ТекЗаказ.Статус.Код, "Заказ на магистрали",,,МассивСтатусов, ДопПараметрыСтатуса);
		//Асеев 07.04.2021 (Задача № 4529)<<<

	КонецЦикла;
	
	СтруктураВозврата = mas.ОтправитьМассивСтатусовЗаказов(МассивСтатусов);// Задача № 2813	
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Отказ = Истина;	
	
КонецПроцедуры
